src/cf/Documents/GDS_АктПриемаПередачиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_АктПриемаПередачиТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.GDS_ЭлементыПроверки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсмотрПровел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одометр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрПрицепТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТопливаПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматированноеОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПринял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПрицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_ПунктыПроверкиТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.GDS_СостоянияПроверкиАПП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПроблем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замечания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ЭлементыПроверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ЭлементыПроверки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_СостоянияПроверкиАПП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеПроблем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Замечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GDS_ПунктыПроверкиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/GDS_СостоянияПроверкиАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_СостоянияПроверкиАПП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неисправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вналичии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/GDS_ПунктыПроверкиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>GDS_ПунктыПроверкиТС</Name>
			<Comment>Пункты проверки ТС для акта-приема пердачи</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМодели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыМоделейТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/GDS_АктПриемаПередачиТС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		//ДокументОснование = ДанныеЗаполнения;
		
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ПУ                = ДанныеЗаполнения.ПУ;
		ДатаОсмотра       = ДанныеЗаполнения.ДатаОсмотра;
		ТС                = ДанныеЗаполнения.ТС;
		Одометр           = ДанныеЗаполнения.Одометр;
		ОдометрТО         = ДанныеЗаполнения.ОдометрТО;
		ОстатокТоплива    = ДанныеЗаполнения.ОстатокТоплива;
		Платон            = ДанныеЗаполнения.Платон;
		Пробег            = ДанныеЗаполнения.Пробег;
		
		ОдометрПрицеп        = ДанныеЗаполнения.ОдометрПрицеп;
		ОдометрПрицепТО      = ДанныеЗаполнения.ОдометрПрицепТО;
		ПробегПрицеп         = ДанныеЗаполнения.ПробегПрицеп;
		ОстатокТопливаПрицеп = ДанныеЗаполнения.ОстатокТопливаПрицеп;
		СтрокаПрицеп         = ДанныеЗаполнения.СтрокаПрицеп;
		СтрокаПринял         = ДанныеЗаполнения.СтрокаПринял;
		Ответственный        = ДанныеЗаполнения.Ответственный;
		
		Замечания         = ДанныеЗаполнения.Замечания;
		ПримечаниеКСостояниюПрицепа = ДанныеЗаполнения.ПримечаниеКСостояниюПрицепа;
		
		Если ТипЗнч(ДанныеЗаполнения.ЭлементыПроверки) = Тип("Структура") Тогда
			
			Для Каждого СтрТягач Из ДанныеЗаполнения.ЭлементыПроверки.ДанныеТягача Цикл
				НоваяСтрока = ЭлементыПроверки.Добавить();
				
				НоваяСтрока.ТС					= ДанныеЗаполнения.ТС;
				НоваяСтрока.ЭлементПроверки		= Справочники.GDS_ПунктыПроверкиТС.НайтиПоНаименованию(СтрТягач.Пункт);
				
				НоваяСтрока.Состояние 			= Перечисления.GDS_СостоянияПроверкиАПП.ЗначениеИзСтроки(СтрТягач.Ответ.Радиокнопка);
				НоваяСтрока.Замечания 			= СтрТягач.Ответ.Комментарий;
			КонецЦикла;
			
			Для Каждого СтрТС Из ДанныеЗаполнения.ЭлементыПроверки.ДанныеТС Цикл
				НоваяСтрока = ЭлементыПроверки.Добавить();
				
				НоваяСтрока.ТС					= ДанныеЗаполнения.ТС;
				НоваяСтрока.ЭлементПроверки		= Справочники.GDS_ПунктыПроверкиТС.НайтиПоНаименованию(СтрТС.Пункт);
				
				НоваяСтрока.Состояние 			= Перечисления.GDS_СостоянияПроверкиАПП.ЗначениеИзСтроки(СтрТС.Ответ.Радиокнопка);
				НоваяСтрока.Замечания 			= СтрТС.Ответ.Комментарий;
			КонецЦикла;
			
			Для Каждого СтрПрицеп Из ДанныеЗаполнения.ЭлементыПроверки.ДанныеПрицепа Цикл
				НоваяСтрока = ЭлементыПроверки.Добавить();
				
				НоваяСтрока.ТС					= Справочники.уатТС.ПустаяСсылка();//ДанныеЗаполнения.ТС;
				НоваяСтрока.ЭлементПроверки		= Справочники.GDS_ПунктыПроверкиТС.НайтиПоНаименованию(СтрПрицеп.Пункт);
				
				НоваяСтрока.Состояние 			= Перечисления.GDS_СостоянияПроверкиАПП.ЗначениеИзСтроки(СтрПрицеп.Ответ.Радиокнопка);
				НоваяСтрока.Замечания 			= СтрПрицеп.Ответ.Комментарий;
			КонецЦикла;
			
			Для Каждого СтрПрицеп Из ДанныеЗаполнения.ЭлементыПроверки.ДанныеОстатки Цикл
				НоваяСтрока = ЭлементыПроверки.Добавить();
				
				НоваяСтрока.ТС					= Справочники.уатТС.ПустаяСсылка();//ДанныеЗаполнения.ТС;
				НоваяСтрока.ЭлементПроверки		= Справочники.GDS_ПунктыПроверкиТС.НайтиПоНаименованию(СтрПрицеп.Пункт);
				
				НоваяСтрока.Состояние 			= Перечисления.GDS_СостоянияПроверкиАПП.ЗначениеИзСтроки(СтрПрицеп.Ответ.Радиокнопка);
				НоваяСтрока.Замечания 			= СтрПрицеп.Ответ.Комментарий;
			КонецЦикла;
			
		КонецЕсли;
		
		//ВРЕМЕННО _ НУЖНО ПЕРЕДЕЛАТЬ
		ТЧ_Проверка = ЭлементыПроверки.Выгрузить(,"ЭлементПроверки,Состояние,Замечания");
		
		Для Каждого СтрОтв Из ТЧ_Проверка Цикл
			Если (СтрОтв.Состояние <> Перечисления.GDS_СостоянияПроверкиАПП.Вналичии
				И СтрОтв.Состояние <> Перечисления.GDS_СостоянияПроверкиАПП.Исправно)
				Или (СтрОтв.Состояние = Перечисления.GDS_СостоянияПроверкиАПП.Исправно
				и СтрОтв.Замечания <> "") Тогда
				
				ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрОтв.ЭлементПроверки,"ФизическоеЛицо");
				Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
					НоваяСтрока = ОтветственныеЛица.Добавить();
					НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ОтветственныеЛица.Свернуть("ФизическоеЛицо");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	
	//ДополнительныеСвойства
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	
	Документы.GDS_АктПриемаПередачиТС.СформироватьТаблицуЭлементыПроверки(Ссылка, ДополнительныеСвойства);
	
	ДвиженияРегистр = Движения.GDS_ЭлементыПроверки;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЭлементыПроверкиТС);

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ПометкаУдаления Тогда
		Если ФорматированноеОписание.Получить() = Неопределено Тогда
			ФорматированныйДокумент = GDS_РаботаСФормитированнымОписаниемСервер.ПолучитьФормитированнуюСтроку(Ссылка);
			
			текТекст = "";
			СтруктураВложений = Новый Структура;
			
			ФорматированныйДокумент.ПолучитьHTML(текТекст, СтруктураВложений);
			
			ФорматированноеОписание = Новый ХранилищеЗначения(текТекст, Новый СжатиеДанных(9));
			
			Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
